app/controllers/blogs_controller.rb

SELECT * FROM `blogs` WHERE (`blogs`.`id` = 1)
---
  def show
	@blog = @user.blogs.find(params[:id])

INSERT INTO `blogs` (`name`, `updated_at`, `user_id`, `created_at`) VALUES(NULL, '2010-01-07 03:04:49', NULL, '2010-01-07 03:04:49')
---
  def create
	@blog = @user.blog.new(params[:blog])

	respond_to do |format|
	  if @blog.save

SELECT * FROM `blogs` WHERE (`blogs`.`id` = 1)
DELETE FROM `blogs` WHERE `id` = 1
---
  def destroy
	@blog = @user.blog.find(params[:id])
	@blog.destroy