app/controllers/posts_controller.rb

SELECT * FROM `posts` WHERE (`posts`.blog_id = 4) ORDER BY created_at DESC
---
  def index
  @posts = @blog.posts.find(:all)

SELECT * FROM `posts` WHERE (`posts`.`id` = 1 AND (`posts`.blog_id = 4)) ORDER BY created_at DESC
---
  def show
  @post = @blog.posts.find(params[:id])

INSERT INTO `posts` (`updated_at`, `title`, `body`, `blog_id`, `created_at`) VALUES('2010-01-07 03:35:00', 'asdasd', 'adasda', 4, '2010-01-07 03:35:00')
---
  def create
  @post = @blog.posts.new(params[:post])

  respond_to do |format|
    if @post.save

SELECT * FROM `blogs` WHERE (`blogs`.`id` = 4)
---
  def find_blog
  @blog = Blog.find(params[:blog_id])