app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `fb_user_id`, `email_hash`, `remember_token`, `login`, `email`, `created_at`) VALUES('anuj', '7d1b2b4b5838a98493c3b00fc1fa09357b5c92b7', '2009-11-27 09:18:37', 'ad547a5bfc0ac87f1cc6a3bfccc0097cb3d32ab2', NULL, NULL, NULL, NULL, 'anuj', 'anuj@anuj.com', '2009-11-27 09:18:37')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `fb_user_id`, `email_hash`, `remember_token`, `login`, `email`, `created_at`) VALUES('Anuj Thapliyal', NULL, '2009-11-17 06:30:47', NULL, NULL, 697322403, NULL, NULL, 'facebooker_697322403', '', '2009-11-17 06:30:47')
---
  def link_user_accounts
    if self.current_user.nil?
      #register with fb
      User.create_from_fb_connect(facebook_session.user)